## Pandas

#### Instructor: Dan Wang

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## 1 Introduction to pandas Data Structures

### 1.1 Seris

In [2]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2['a']

-5

In [7]:
obj2['d'] = 5
obj2

d    5
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [9]:
obj2[obj2 > 0]

d    5
b    7
c    3
dtype: int64

In [10]:
obj2 * 2

d    10
b    14
a   -10
c     6
dtype: int64

In [11]:
np.exp(obj2)

d     148.413159
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [12]:
'c' in obj2

True

In [13]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [14]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index= states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [15]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [16]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [17]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [18]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

### 1.2 DataFrame

In [70]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [71]:
obj = Series(data)

In [72]:
obj

state    [Ohio, Ohio, Ohio, Nevada, Nevada]
year         [2000, 2001, 2002, 2001, 2002]
pop               [1.5, 1.7, 3.6, 2.4, 2.9]
dtype: object

In [73]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [74]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [75]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])

In [76]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [77]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: pop, dtype: float64

In [78]:
frame2.year + 1

one      2001
two      2002
three    2003
four     2002
five     2003
Name: year, dtype: int64

In [79]:
frame2.loc[['three','five']]

       year   state  pop debt
three  2002    Ohio  3.6  NaN
five   2002  Nevada  2.9  NaN

In [85]:
frame2.ix[2:4,:]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

       year   state  pop debt  eastern
three  2002    Ohio  3.6  NaN     True
four   2001  Nevada  2.4  NaN    False

In [34]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [35]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [36]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [81]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop debt  eastern
one    2000    Ohio  1.5  NaN     True
two    2001    Ohio  1.7  NaN     True
three  2002    Ohio  3.6  NaN     True
four   2001  Nevada  2.4  NaN    False
five   2002  Nevada  2.9  NaN    False

In [39]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [23]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [24]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [25]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

## 2 Essential Functionality

### 2.1 Reindexing

In [45]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [435]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [436]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [437]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [439]:
obj3.reindex(range(6), method='bfill') #bfill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [46]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [48]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'], method ='ffill')
frame2

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

### 2.2 Dropping entries from an axis

In [49]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [50]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [51]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [52]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [53]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### 2.3 Indexing, selection, and filtering

In [54]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [60]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [63]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [64]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [27]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [28]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [29]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [30]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [72]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [39]:
data.ix['Colorado', ['two', 'three']]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int64

In [42]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [43]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [47]:
data.ix[data.three > 5, :3]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

### 2.4 Arithmetic and data alignment

In [48]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [49]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [50]:
s1.add(s2, fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

### 2.5 Function application and mapping

In [59]:
frame = DataFrame(np.random.randn(4, 3), 
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [54]:
frame

               b         d         e
Utah   -0.394250 -1.803209 -1.014594
Ohio   -0.297170 -1.789213 -1.060636
Texas  -1.272010  0.586539  1.088498
Oregon  1.153993  0.449028  0.071808

In [55]:
np.abs(frame)

               b         d         e
Utah    0.394250  1.803209  1.014594
Ohio    0.297170  1.789213  1.060636
Texas   1.272010  0.586539  1.088498
Oregon  1.153993  0.449028  0.071808

In [61]:
f = lambda x: np.abs(x).max() - np.abs(x).min()

In [62]:
frame.apply(f)

b    1.347408
d    1.138498
e    1.511371
dtype: float64

In [93]:
frame.apply(f, axis=1)

Utah      1.556194
Ohio      0.386067
Texas     2.273142
Oregon    1.074906
dtype: float64

In [94]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.014123 -0.894043 -2.366924
max  1.090521  1.088530  2.287265

### 2.5 Sorting and ranking

In [18]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [12]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [19]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [20]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [10]:
frame.sort_index(1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [21]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [22]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [23]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [24]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### Correlation and Covariance

In [117]:
ret = DataFrame(np.random.rand(400).reshape((100, 4)),columns=['AAPL', 'GD', 'IBM', 'MSFT'])
ret.head()

       AAPL        GD       IBM      MSFT
0  0.493571  0.659615  0.779855  0.567630
1  0.437007  0.502442  0.138623  0.588344
2  0.416048  0.176147  0.745190  0.427137
3  0.940661  0.257825  0.965875  0.874027
4  0.919258  0.699108  0.215732  0.456825

In [118]:
ret.corr()

          AAPL        GD       IBM      MSFT
AAPL  1.000000  0.024616  0.237433  0.025068
GD    0.024616  1.000000 -0.013685  0.210291
IBM   0.237433 -0.013685  1.000000  0.082939
MSFT  0.025068  0.210291  0.082939  1.000000

In [119]:
ret.cov()

          AAPL        GD       IBM      MSFT
AAPL  0.078130  0.001957  0.019208  0.001972
GD    0.001957  0.080859 -0.001126  0.016829
IBM   0.019208 -0.001126  0.083766  0.006756
MSFT  0.001972  0.016829  0.006756  0.079203

## Deal with missing data

In [120]:
from numpy import nan as NA

In [121]:
data = DataFrame([[1., 6.5, 4.], [1., NA, NA],
.....: [NA, NA, NA], [NA, 6, 9.]])
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  9.0

In [123]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  4.0

In [124]:
data.fillna(0)

     0    1    2
0  1.0  6.5  4.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.0  9.0

In [125]:
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  9.0

In [126]:
data.fillna(method='ffill')

     0    1    2
0  1.0  6.5  4.0
1  1.0  6.5  4.0
2  1.0  6.5  4.0
3  1.0  6.0  9.0

In [127]:
data.fillna(data.mean())

     0     1    2
0  1.0  6.50  4.0
1  1.0  6.25  6.5
2  1.0  6.25  6.5
3  1.0  6.00  9.0

In [128]:
s = pd.Series([0, 1, np.nan, 3])
s

0    0.0
1    1.0
2    NaN
3    3.0
dtype: float64

In [129]:
s.interpolate()

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64